In [1]:
import pandas as pd
import numpy as np

In [2]:
discharges=pd.read_csv('ccaa_covid19_altas_long.csv')

In [3]:
cases=pd.read_csv('ccaa_covid19_casos_long.csv')

In [4]:
deaths=pd.read_csv('ccaa_covid19_fallecidos_long.csv')

In [5]:
hospitalized=pd.read_csv('ccaa_covid19_hospitalizados_long.csv')

In [6]:
ICU=pd.read_csv('ccaa_covid19_uci_long.csv')

In [7]:
masks=pd.read_csv('ccaa_covid19_mascarillas.csv')

In [8]:
ICU_beds_2017=pd.read_csv('ccaa_camas_uci_2017.csv')

In [9]:
national_covid19=pd.read_csv('nacional_covid19.csv')

In [10]:
national_age_gender=pd.read_csv('nacional_covid19_rango_edad.csv')

In [11]:
discharges.head()

        fecha  cod_ine       CCAA  total
0  2020-03-01        1  Andalucía    NaN
1  2020-03-09        1  Andalucía   11.0
2  2020-03-10        1  Andalucía   11.0
3  2020-03-11        1  Andalucía   11.0
4  2020-03-12        1  Andalucía   11.0

In [12]:
discharges.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1368 entries, 0 to 1367
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   fecha    1368 non-null   object
 1   cod_ine  1368 non-null   int64
 2   CCAA     1368 non-null   object
 3   total    1344 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 42.9+ KB

In [13]:
cases.head()

        fecha  cod_ine       CCAA  total
0  2020-02-21        1  Andalucía      0
1  2020-02-22        1  Andalucía      0
2  2020-02-23        1  Andalucía      0
3  2020-02-24        1  Andalucía      0
4  2020-02-25        1  Andalucía      0

In [14]:
cases.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1729 entries, 0 to 1728
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   fecha    1729 non-null   object
 1   cod_ine  1729 non-null   int64
 2   CCAA     1729 non-null   object
 3   total    1729 non-null   int64
dtypes: int64(2), object(2)
memory usage: 54.2+ KB

In [15]:
deaths.head()

        fecha  cod_ine       CCAA  total
0  2020-03-04        1  Andalucía      0
1  2020-03-05        1  Andalucía      0
2  2020-03-06        1  Andalucía      0
3  2020-03-07        1  Andalucía      0
4  2020-03-08        1  Andalucía      0

In [10]:
deaths.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1558 entries, 0 to 1557
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   fecha    1558 non-null   object
 1   cod_ine  1558 non-null   int64
 2   CCAA     1558 non-null   object
 3   total    1558 non-null   int64
dtypes: int64(2), object(2)
memory usage: 48.8+ KB

In [16]:
hospitalized.head()

        fecha  cod_ine       CCAA  total
0  2020-02-21        1  Andalucía    NaN
1  2020-02-22        1  Andalucía    NaN
2  2020-02-23        1  Andalucía    NaN
3  2020-02-24        1  Andalucía    NaN
4  2020-02-25        1  Andalucía    NaN

In [13]:
hospitalized.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1786 entries, 0 to 1785
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   fecha    1786 non-null   object
 1   cod_ine  1786 non-null   int64
 2   CCAA     1786 non-null   object
 3   total    1458 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 55.9+ KB

In [17]:
ICU.head()

        fecha  cod_ine       CCAA  total
0  2020-02-21        1  Andalucía    NaN
1  2020-02-22        1  Andalucía    NaN
2  2020-02-23        1  Andalucía    NaN
3  2020-02-24        1  Andalucía    NaN
4  2020-02-25        1  Andalucía    NaN

In [16]:
ICU.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1786 entries, 0 to 1785
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   fecha    1786 non-null   object
 1   cod_ine  1786 non-null   int64
 2   CCAA     1786 non-null   object
 3   total    1488 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 55.9+ KB

In [18]:
masks.head()

        fecha  cod_ine       CCAA  mascarillas_acumulado_desde_2020-03-10
0  2020-03-22      1.0  ANDALUCÍA                                  444083
1  2020-03-22      2.0     ARAGÓN                                   72455
2  2020-03-22      3.0   ASTURIAS                                   60229
3  2020-03-22      4.0   BALEARES                                   49476
4  2020-03-22      5.0   CANARIAS                                  124165

In [19]:
masks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 4 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   fecha                                   58 non-null     object
 1   cod_ine                                 57 non-null     float64
 2   CCAA                                    58 non-null     object
 3   mascarillas_acumulado_desde_2020-03-10  58 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 1.9+ KB

In [19]:
ICU_beds_2017.head()

   cod_ine                 CCAA  Públicos  Privados  Total
0        1            ANDALUCÍA       572       162    734
1        2               ARAGÓN       113        22    135
2        3             ASTURIAS        86         7     93
3       15  C. FORAL DE NAVARRA        46        19     65
4        5             CANARIAS       187        50    237

In [22]:
ICU_beds_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cod_ine   17 non-null     int64
 1   CCAA      17 non-null     object
 2   Públicos  17 non-null     int64
 3   Privados  17 non-null     int64
 4   Total     17 non-null     int64
dtypes: int64(4), object(1)
memory usage: 808.0+ bytes

In [20]:
national_covid19.head()

,fecha,casos_total,casos_pcr,casos_test_ac,altas,fallecimientos,ingresos_uci,hospitalizados
0,2020-02-21,3.0,3,NaN,NaN,NaN,NaN,NaN
1,2020-02-22,3.0,3,NaN,NaN,NaN,NaN,NaN
2,2020-02-23,3.0,3,NaN,NaN,NaN,NaN,NaN
3,2020-02-24,3.0,3,NaN,NaN,NaN,NaN,NaN
4,2020-02-25,4.0,4,NaN,NaN,NaN,NaN,NaN

In [25]:
national_covid19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263 entries, 0 to 262
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   fecha           263 non-null    object
 1   casos_total     91 non-null     float64
 2   casos_pcr       263 non-null    int64
 3   casos_test_ac   48 non-null     float64
 4   altas           71 non-null     float64
 5   fallecimientos  251 non-null    float64
 6   ingresos_uci    193 non-null    float64
 7   hospitalizados  195 non-null    float64
dtypes: float64(6), int64(1), object(1)
memory usage: 16.6+ KB

In [21]:
national_age_gender.head()

,fecha,rango_edad,sexo,casos_confirmados,hospitalizados,ingresos_uci,fallecidos
0,2020-03-23,0-9,ambos,129,34,1,0
1,2020-03-23,10-19,ambos,221,15,0,1
2,2020-03-23,20-29,ambos,1285,183,8,4
3,2020-03-23,30-39,ambos,2208,365,15,3
4,2020-03-23,40-49,ambos,2919,663,40,9

In [28]:
national_age_gender.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1878 entries, 0 to 1877
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   fecha              1878 non-null   object
 1   rango_edad         1878 non-null   object
 2   sexo               1878 non-null   object
 3   casos_confirmados  1878 non-null   int64
 4   hospitalizados     1878 non-null   int64
 5   ingresos_uci       1878 non-null   int64
 6   fallecidos         1878 non-null   int64
dtypes: int64(4), object(3)
memory usage: 102.8+ KB

In [22]:
discharges.columns

Index(['fecha', 'cod_ine', 'CCAA', 'total'], dtype='object')

In [30]:
rename_dct = {'fecha': 'date',
             'rango_edad': 'age',
             'sexo': 'gender',
             'casos_confirmados': 'confirmed_cases',
             'hospitalizados': 'hospitalized', 
             'fallecidos': 'deceed',
             'ingresos_uci': 'ICU_new_entrances',
             'casos_total': 'total_cases',
             'casos_pcr': 'pcr_cases',
             'altas': 'discharges',
             'casos_test_ac': 'ACtest_cases',
             'fallecimientos': 'deceed',
             'CCAA': 'region',
             'Públicos': 'public',
             'Privados': 'private',
             'mascarillas_acumulado_desde_2020-03-10': 'masks_available_since200310',
             }

#df = df.rename(columns=rename_dct)

def rename_dfs(dfs_lst, rename_dct):
    return [df.rename(columns=rename_dct) for df in dfs_lst]

dfs_lst = [discharges, cases, deaths, hospitalized, ICU, masks, ICU_beds_2017, national_covid19, national_age_gender]

discharges_renamed, cases_renamed, deaths_renamed, hospitalized_renamed, ICU_renamed, masks_renamed, ICU_beds_2017_renamed, national_covid19_renamed, national_age_gender_renamed = rename_dfs(dfs_lst, rename_dct)

discharges_renamed

            date  cod_ine     region   total
0     2020-03-01        1  Andalucía     NaN
1     2020-03-09        1  Andalucía    11.0
2     2020-03-10        1  Andalucía    11.0
3     2020-03-11        1  Andalucía    11.0
4     2020-03-12        1  Andalucía    11.0
...          ...      ...        ...     ...
1363  2020-05-14       17   La Rioja  2867.0
1364  2020-05-15       17   La Rioja  2927.0
1365  2020-05-16       17   La Rioja  2990.0
1366  2020-05-17       17   La Rioja  3048.0
1367  2020-05-18       17   La Rioja  3107.0

[1368 rows x 4 columns]

In [33]:
discharges_renamed.to_csv("./discharges_renamed.csv")

In [34]:
deaths_renamed.to_csv("./deaths_renamed.csv")

In [39]:
cases_renamed.head ()

         date  cod_ine     region  total
0  2020-02-21        1  Andalucía      0
1  2020-02-22        1  Andalucía      0
2  2020-02-23        1  Andalucía      0
3  2020-02-24        1  Andalucía      0
4  2020-02-25        1  Andalucía      0

In [40]:
cases_renamed.to_csv("./cases_renamed.csv")